astb_relise/src/InformationRegisters/ПараметрыПодключенияКСервисуДляЗагрузкиГТД/ПараметрыПодключенияКСервисуДляЗагрузкиГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПодключенияКСервисуДляЗагрузкиГТД</name>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>URI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ПараметрыПодключенияКСервисуДляЗагрузкиГТД/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	ПолучитьПроксиНаСервере();	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ПроверитьПодключениеНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПроксиНаСервере()
	
	ОписаниеОшибки = "";
	
	Прокси = РегистрыСведений.ПараметрыПодключенияКСервисуДляЗагрузкиГТД.ПолучитьПрокси(ОписаниеОшибки,Запись.Адрес,Запись.URI,Запись.Пользователь,Запись.Пароль);
	
	Если Прокси = Неопределено Тогда
		ОписаниеОшибки = "Ошибка подключения." + Символы.ПС + ОписаниеОшибки;
	Иначе
		ОписаниеОшибки = "Подключение установлено.";
	КонецЕсли;
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ОписаниеОшибки;
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры
